fullForcedChannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    walls
   {
        type        porousInterfaceBJS;
        value        uniform (1 0 0);

        alpha       1;
        slipCoeff   uniform 0.02;

    }


    inlet
    {
        type            zeroGradient;//fixedProfile;//fixedValue;
        value           uniform (1 0 0);

        profile         polynomial
        (
            ((1.5 0 0)        (0 0 0))
            ((-1.5 0 0)    (2 0 0))
        );
        direction       (0 0 1);
        origin          0;
    }

    outlet
    {
        type            zeroGradient;//pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
